---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyleOverrideOptions.Underline
source: html/98624069-f1cd-5bf9-4e88-4f289bd5cfa2.htm
---
# Autodesk.Revit.DB.TableCellStyleOverrideOptions.Underline Property

Indicates if the underline characteristic is overridden.

## Syntax (C#)
```csharp
public bool Underline { get; set; }
```